import streamlit as slt

slt.markdown("# 最后的碎碎念～")

slt.markdown("""

------

### Part I 一个小插曲

> 现在的时间是4月2日10:23分。瑜瑜子上雅思去啦！
> 
> 这也是一天后笑笑再一次打开这个网站，把最后的碎碎念部分补上。
> 
> 先跟瑜瑜讲个今天最妙的故事。当然，这个故事实际上是瑜瑜讲给笑笑的。
> 
> 瑜瑜去上课时候，讲到昨晚做了个奇怪的梦：有个人被人追杀，告诉瑜瑜一张藏宝图，上面是一些数据科学的看板。笑笑当时说：会不会这个梦实际上是对现实世界的折射？
> 
> 其实这句话话里有话。因为那个数据科学的看板，和这个小礼物如此相像：或许，这就是瑜瑜梦里那个藏宝图的折射——笑笑以一种隐晦的方式剧透了这个礼物的存在。
> 
> 希望瑜瑜会喜欢这个小小的礼物。

-------------

### Part II 一条时间线

这个项目的构思时间很长，但是动手做的时间很短，5天时间就完成了从零到落地的全过程，像是笑笑生命中一朵小水花：

- 寒假时候笑笑完成了相关技术准备、可行性论证、网站初步搭建；
- 3月27日，笑笑正式开始做细节部分。由于有了初代版本的源代码，数据处理的部分做得很快；
- 3月30号开始跑情绪分析的部分，优化了数据库读取机制，平均加载时间从1.29s减少到0.24s，解决了卡顿的问题；
- 3月31号知道了自己考研的最终结果，心安下来，有更多时间专心做这个小项目；
- 4月2号：修改完毕文本部分，最终提交；


---------------

### Part III 一些展望

> 这一部分笑笑犹豫了很久才下笔。
> 
> 把初代版本的后记看了好几遍好几遍，发现去年今日，迷茫而被封校困得不知所措的我们，对未来充满了好奇。笑笑在犹豫自己该如何面对考研，瑜瑜在卷自己的两门数学课，不知道如何在未来的信管求生。
> 
> 但是今年今日，一切都有很大地不同。笑笑刚刚收到过线的通知，顶着百年未遇的局面参加了考试；瑜瑜也克服了大一下的课程，进入信管，熟悉了信管的节奏；做了比赛、参加了大创、报名了雅思、把排名挤到了前面，甚至可以坐在去新国立交换的面试现场和这里最顶尖的学生一较高下，闲暇之余还率队拿到了新生杯的冠军。
> 
> 笑笑不喜欢强迫自己写年终总结，所谓的总结，应该是随时回望自己的过去，然后发现：哦，原来，这一切都是值得的，我做的这么多，都是有回报的；那个正在奋斗的自己，就是最好的模样。
> 
> 笑笑很喜欢“瑜”这个字。到底是因人爱字，还是因字更加爱人，笑笑不知道。
> 
> 当人不再怀疑自己是否是美玉的时候，人往往已成美玉。

""")

slt.markdown("_我们终将熠熠生辉。_")

col1, col2, col3 = slt.columns(3)
col2.markdown("好啦好啦不废话啦，说得有点偏题了，重点都忘说啦！：")
slt.markdown("<h1 style='text-align: center; color: darkpink;'>祝瑜瑜20岁生日快乐！</h1>",
             unsafe_allow_html=True)

slt.markdown("<h1 style='text-align: center; color: pink;'>永远开心，永远漂亮，永远是那个最好的自己～</h1>",
             unsafe_allow_html=True)
# slt.title("")

slt.markdown("""

""")
slt.markdown("<h5 style='text-align: right; color: lightblue;'>——爱你的笑笑</h5>",
             unsafe_allow_html=True)
